HTRamsey/FreeRTOS-Plus-TCP/test/network-interface/stm32/hal-config/H7RS/stm32h7rsxx_hal_conf.h
/* SPDX-License-Identifier: MIT */

#ifndef STM32H7RSXX_HAL_CONF_H
#define STM32H7RSXX_HAL_CONF_H

#define HAL_MODULE_ENABLED
#define HAL_ETH_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define USE_HAL_ETH_REGISTER_CALLBACKS    0U

#include "stm32h7rsxx_hal_rcc.h"
#include "stm32h7rsxx_hal_cortex.h"
#include "stm32h7rsxx_hal_eth.h"

#define assert_param( expression )    ( ( void ) ( expression ) )

#endif /* STM32H7RSXX_HAL_CONF_H */
